# Terminal
brew "zsh"
cask "iterm2"

# SCM
brew "git"
brew "hub"

# Editor
brew "neovim"

# Development Tools
brew "asdf"
brew "fzf"
brew "the_silver_searcher"
brew "readline"
brew "cmake"
brew "ctags"

# Containerization
brew "docker"
brew "docker-compose"

# Browsers
cask "google-chrome"
cask "firefox"
cask "chromedriver"

# macOS Window Management
cask "spectacle"
