# Terminal
brew "zsh"
cask "iterm2"
brew "p7zip"
brew "wget"

# SCM
brew "git"
brew "hub"

# Editor
brew "neovim"
cask "visual-studio-code"

# Development Tools
brew "asdf"
brew "fzf"
brew "the_silver_searcher"
brew "readline"
brew "cmake"
brew "ctags"
brew "hugo"
brew "jq"
brew "yarn"
brew "postgresql"

# Deployment platforms
brew "aws-elasticbeanstalk"

# Containerization
cask "docker"
brew "docker-compose"

# Browsers
cask "google-chrome"
cask "firefox"
cask "chromedriver"

# macOS Window Management
cask "spectacle"

# media
cask "clementine"
cask "vlc"
brew "ffmpeg"
cask "soundflower"

# mac app store
brew "mas"
mas "Wimoweh", id: 610341008
mas "Skitch", id: 425955336
mas "GIPHY CAPTURE", id: 668208984
mas "Slack", id: 803453959
