# Terminal
brew "zsh"
cask "iterm2"

# SCM
brew "git"
brew "hub"

# Editor
brew "neovim"

# Development Tools
brew "asdf"
brew "fzf"
brew "the_silver_searcher"
brew "readline"
brew "cmake"
brew "ctags"

# Deployment platforms
brew "aws-elasticbeanstalk"

# Containerization
brew "docker"
brew "docker-compose"

# Browsers
cask "google-chrome"
cask "firefox"
cask "chromedriver"

# macOS Window Management
cask "spectacle"

# media
cask "clementine"
cask "vlc"

# mac app store
brew "mas"
mas "Wimoweh", id: 610341008
mas "Skitch", id: 425955336
mas "GIPHY CAPTURE", id: 668208984
mas "Slack", id: 803453959
